In [31]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [32]:
data = pd.read_csv('hiring.csv')

In [33]:
data

,experience,test_score(out of 10),interview_score(out of 10),salary($),Unnamed: 4
0,NaN,8.0,9.0,50000.0,NaN
1,NaN,8.0,6.0,45000.0,NaN
2,five,6.0,7.0,60000.0,NaN
3,two,10.0,10.0,65000.0,NaN
4,seven,9.0,6.0,70000.0,NaN
5,three,7.0,10.0,62000.0,NaN
6,ten,NaN,7.0,72000.0,NaN
7,eleven,7.0,8.0,80000.0,NaN
8,NaN,NaN,NaN,NaN,NaN

In [34]:
data.drop(8,axis=0,inplace=True)

In [35]:
data.drop('Unnamed: 4',axis=1,inplace=True)

In [36]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                         9.0    50000.0
1        NaN                    8.0                         6.0    45000.0
2       five                    6.0                         7.0    60000.0
3        two                   10.0                        10.0    65000.0
4      seven                    9.0                         6.0    70000.0
5      three                    7.0                        10.0    62000.0
6        ten                    NaN                         7.0    72000.0
7     eleven                    7.0                         8.0    80000.0

In [37]:
data['experience']=data['experience'].fillna('zero')

In [38]:
data['experience']

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [39]:
from word2number import w2n

In [40]:
data['experience']= data['experience'].apply(w2n.word_to_num)

In [41]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                         9.0    50000.0
1           0                    8.0                         6.0    45000.0
2           5                    6.0                         7.0    60000.0
3           2                   10.0                        10.0    65000.0
4           7                    9.0                         6.0    70000.0
5           3                    7.0                        10.0    62000.0
6          10                    NaN                         7.0    72000.0
7          11                    7.0                         8.0    80000.0

In [56]:
import math

In [57]:
median = math.floor(data['test_score(out of 10)'].mean())

In [58]:
data['test_score(out of 10)'] = data['test_score(out of 10)'].fillna(median)

In [59]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                         9.0    50000.0
1           0                    8.0                         6.0    45000.0
2           5                    6.0                         7.0    60000.0
3           2                   10.0                        10.0    65000.0
4           7                    9.0                         6.0    70000.0
5           3                    7.0                        10.0    62000.0
6          10                    8.0                         7.0    72000.0
7          11                    7.0                         8.0    80000.0

In [60]:
X = data.drop('salary($)',axis=1)

In [61]:
X

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                         9.0
1           0                    8.0                         6.0
2           5                    6.0                         7.0
3           2                   10.0                        10.0
4           7                    9.0                         6.0
5           3                    7.0                        10.0
6          10                    8.0                         7.0
7          11                    7.0                         8.0

In [62]:
y = data['salary($)']

In [63]:
y

0    50000.0
1    45000.0
2    60000.0
3    65000.0
4    70000.0
5    62000.0
6    72000.0
7    80000.0
Name: salary($), dtype: float64

In [64]:
from sklearn.linear_model import LinearRegression

In [65]:
lr = LinearRegression()

In [66]:
lr.fit(X,y)

LinearRegression()

In [67]:
lr.predict([[2,9,6]])

array([53205.96797671])

In [68]:
lr.predict([[12,10,10]])

array([92002.18340611])